#include <iostream>
using namespace std;

int main() {
    // Потребителят въвежда произволно число n от клавиатурата
    int n;
    cout << "Въведете число N: ";
    cin >> n;

    //  Проверяваме дали числото n се дели на 5, и на 3 едновременно (% връща дали числото се дели без остатък) && - логически опрератор, при който и двето условия в преврката трябва да са верни
    if (n % 5 == 0 && n % 3 == 0) {
        cout << "Числото " << n << " се дели на 5 и на 3 едновременно.\n";
    } else {
       cout <<"Числото " << n << " не се дели на 5 и на 3 едновременно.\n";
    }

    return 0;
}


#include <iostream>

using namespace std;

int main() {
    // Инициализираме променлива, която ще кол
    int count = 0;

    // Инициализираме for цикъл през всички четирицифрени числа в интервала [1000 - 9999]
    for (int num = 1000; num < 9999; ++num) {

        // Извличане на първата цифра на числото
        int firstDigit = num / 1000; // делим на 1000 тъй като всички числа са четири цифрени

        // Извличане последната цифра на числото
        int lastDigit = num % 10;

        // Проверявам дали първата и последната цифра са еднакви
        if (firstDigit == lastDigit) {
            // Увеличаване на брояча
            count++; // Съответсва на count += 1;
        }
    }

    // Извеждане на резултата
    cout << "Броят е: " << count << endl;

    return 0;
}


#include <iostream>
using namespace std;

int main() {
    // Въвеждане на броя на елементите в масива
    int n;

    cout << "Въведете броя на елементите в масива: ";

    cin >> n;

    // Използвам VS Code и за това инциализрам масив с 100 елемента, ако се въведат повече от 100 елемента, след 100ния няма да се запазят
    int A[100];

    // Попълваме елементите на масива
    cout << "Въведете елементите на масива:\n";
    for (int i = 0; i < n; ++i) {
        cout << "A[" << i << "]: ";
        cin >> A[i];
    }

    // Инициализираме си променлива за сумата на елементите с нечетна стойност
    int sum = 0;

    for (int i = 0; i < n; ++i) {
        // A[i] % 2 != 0 - проверява дали числото е нечечтно, ако е нечетно го добавя към sum
        if (A[i] % 2 != 0) {
            sum += A[i];
        }
    }
    // Принтираме резлутата на конзолата

    cout << "Сумата на нечетните елементи е: " << sum << endl;

    return 0;
}


#include<iostream>

using namespace std;

int main() {
    int n, m;

    // Въвеждане на размерите на матрицата
    cout << "Въведете боря редове (n): ";
    cin >> n;
    cout << "Въведете боря колони (m): ";
    cin >> m;

    // Използвам VS Code и за това инциализрам матрицата със 100 на 100 елемента
    int A[100][100];

    cout << "Въведете елементите на матрицата:" << endl;
    for (int i = 0; i < n; ++i) {
        for (int j = 0; j < m; ++j) {
            cout << "A[" << i << "][" << j << "]: ";
            cin >> A[i][j];
        }
    }

    // Намиране на броя на отрицателните елементи на редовете с четни индекси
    // Променливата count е за отб. броя на отрицателните елементи разположени на редове с четни индекси, което се постига i+=2
    int count = 0;
    for (int i = 1; i < n; i += 2) {
        for (int j = 0; j < m; ++j) {
            if (A[i][j] < 0) {
                count++;
            }
        }
    }

    // Показване на резултата
    cout << "Броят на отрицателните елементи на четни редове е: " << count << endl;

    return 0;
}
